package 대덕인재개발원;

public class ch1변수 {
	public static void main(String[] args) {
		/*
		 * 1. 변수 선언 및 초기화 연습(40선)
		 */
		// 문제 1, 정수형 타입 변수 a1을 선언해주세요.
		int a1;
		
		// 문제 2, 정수형 타입 변수 a2을 선언해주세요.
		int a2;
		
		// 문제 3, 변수 a1에 정수 값 50을 초기화해주세요.
		a1 = 50;
		
		// 문제 4, 변수 a2에 정수 값 30을 초기화해주세요.
		a2 = 30;
		
		// 문제 5, 문자열 타입 변수 str1을 선언해주세요.
		String str1;
		
		// 문제 6, 문자열 타입 변수 str2을 선언해주세요.
		String str2;
		
		// 문제 7, 문자열 타입 변수 str3을 선언해주세요.
		String str3;
		
		// 문제 8, 논리형 타입 변수 flag1을 선언해주세요.
		boolean flag1;
		
		// 문제 9, 논리형 타입 변수 flag2를 선언해주세요.
		boolean flag2;
		
		// 문제 10, 변수 str1에 값 "Hello"로 초기화해주세요.
		str1 = "Hello";
		
		// 문제 11, 변수 str2에 값 "World!"로 초기화해주세요.
		str2 = "World!";
		
		// 문제 12, 변수 flag1에 false로 초기화해주세요.
		flag1 = false;
		
		// 문제 13, 변수 flag2에 true로 초기화해주세요.
		flag2 = true;
		
		// 문제 14, 실수형 타입 중, f로 시작하는 타입의 변수 f1을 3.1로 초기화해주세요.
		float f1 = 3.1f;
		
		// 문제 15, 실수형 타입 중, f로 시작하는 타입의 변수 f2를 3.14로 초기화해주세요.
		float f2 = 3.14f;
		
		// 문제 16, 실수형 타입 중, d로 시작하는 타입의 변수 d1을 0.04로 초기화해주세요.
		double d1 = 0.04;
		
		// 문제 17, 실수형 타입 중, d로 시작하는 타입의 변수 d2을 3.141592로 초기화해주세요.
		double d2 = 3.141592;
		
		// 문제 18, 변수 a1에 숫자 20을 더한 값을 변수 a1에 초기화해주세요.
		a1 = a1 + 20;
		
		// 문제 19, 변수 a2에 숫자 40을 더한 값을 변수 a2에 초기화해주세요.
		a2 = a2 + 40;
		
		// 문제 20, 변수 a2에 a1을 더한 값을 변수 a2에 초기화해주세요.
		a2 = a1 + a2;
		
		// 문제 21, 변수 str1에 문자열 "_str1"를 추가 후 변수 str1에 초기화해주세요.
		str1 += "_str1";
				
		// 문제 22, 변수 str2에 문자열 "_str2"를 추가 후 변수 str2에 초기화해주세요.
		str2 += "_str2";
		
		// 문제 23, 변수 str3에 변수 str1 + str2를 추가 후 변수 str3에 초기화해주세요.
		str3 = str1 + str2;
		
		// 문제 24, 변수 flag1에 true로 초기화해주세요.
		flag1 = true;
		
		// 문제 25, 변수 flag2에 false로 초기화해주세요.
		flag2 = false;
		
		// 문제 26, 변수 f1에 0.01을 더한 값을 변수 f1에 초기화해주세요.
		f1 = f1 + 0.01f;
		
		// 문제 27, 변수 f2에 3.14를 더한 값을 변수 f2에 초기화해주세요.
		f2 = f2 + 3.14f;
		
		// 문제 28, 변수 f1에 자기자신을 더한 값을 변수 f1에 초기화해주세요.
		f1 = f1 + f1;
		
		// 문제 29. 변수 f2에 자기자신을 더한 값을 변수 f2에 초기화해주세요.
		f2 = f2 + f2;
		
		// 문제 30. 변수 d1에 0.001을 더한 값을 d1에 초기화해주세요.
		d1 = d1 + 0.001;
		
		// 문제 31. 변수 d2에 0.005를 더한 값을 d2에 초기화해주세요.
		d2 = d2 + 0.005;
		
		// 문제 32. 변수 d1에 0.5를 더한 값을 d1에 초기화해주세요.
		d1 = d1 + 0.5;
		
		// 문제 33. 변수 d2에 d1을 더한 값을 d2에 초기화해주세요.
		d2 = d2 + d1;
		
		// 문제 34. 변수 a1,a2,str1,str2,str3,flag1,flag2,f1,f2,d1,d2 변수 모두를 출력해주세요.
		System.out.println("a1("+a1+"), a2("+a2+"), str1("+str1+"), str2("+str2+"), str3("+str3+
				"), flag1("+flag1+"), flag2("+flag2+"), f1("+f1+"), f2("+f2+"), d1("+d1+"), d2("+d2+")");
		
		// 문제 35. 정수형 변수 score를 값 77로 선언 및 초기화해주세요.
		int score = 77;
		
		// 문제 36. 문자열 변수 grade를 값 ""로 선언 및 초기화해주세요.
		String grade = "";
		
		// 문제 37. 문자열 변수 name을 값으로 본인의 이름으로 선언 및 초기화해주세요.
		String name = "박주연";
		
		// 문제 38. 문자열 변수 gender를 값으로 본인의 성별로 선언 및 초기화해주세요.
		String gender = "여자";
		
		// 문제 39. 정수형 변수 age를 값으로 본인의 나이로 선언 및 초기화해주세요.
		int age = 26;
		
		// 문제 40. 문자열 변수 introduction를 값으로 자신의 포부로 선언 및 초기화해주세요.
		String introduction = "열심히하자 제발...";
		
	}
}
